
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

/*
 * Паттерны списков (list pattern) позволяют сопоставлять выражения со списками и 
 * массивами. Данный паттерн пока доступен начиная с версии C# 11.Полное совпадение 
 * с массивом/списком:
 */

Console.WriteLine(GetNumber([1, 2, 3, 4, 5]));  // 1
Console.WriteLine(GetNumber([1, 2]));           // 3
Console.WriteLine(GetNumber([]));               // 4
Console.WriteLine(GetNumber([1, 2, 5]));        // 5

static int GetNumber(int[] values) => values switch
{
[1, 2, 3, 4, 5] => 1,
[1, 2, 3] => 2,
[1, 2] => 3,
[] => 4,
    _ => 5
};

/*
 * Аналогично вместо массивов можно применять списки:
 */

List<int> numbers = [1, 2, 3];

Console.WriteLine(GetNumber2(numbers));  // 2

int GetNumber2(List<int> values) => values switch
{
[1, 2, 3, 4, 5] => 1,
[1, 2, 3] => 2,
[1, 2] => 3,
[] => 4,
    _ => 5
};

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */



/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */